{
  "backend/main.mo": "Defines project, category, message, and featured item types with comparison and filtering utilities, plus maps for storing projects, messages, featured items, and user profiles.",
  "feature_evidence.json": "Lists feature investigation tasks, related files, components, tests, and confidence for UI click-handling and pointer-events fixes.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files such as sections, visuals, hooks, and utilities for build reference.",
  "frontend/index.css": "Defines global Tailwind layers, theme variables, and base styles for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component assembling all sections, global background, theming, and a loading fallback.",
  "frontend/src/components/portfolio/PortfolioItemModal.tsx": "Modal displaying project details with escape-to-close handling and category formatting.",
  "frontend/src/components/sections/AboutSection.tsx": "About section with a glass panel, avatar, orbiting chips, and descriptive bio text.",
  "frontend/src/components/sections/ContactSection.tsx": "A contact form section with validation, submission via mutation, and social/WhatsApp links.",
  "frontend/src/components/sections/FeaturedProjectsSection.tsx": "Displays a carousel of featured project items sourced from backend or placeholders.",
  "frontend/src/components/sections/FooterSection.tsx": "A footer showing the current year and a credit link with a decorative scan-line effect.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with mouse‑reactive animated backgrounds and buttons to scroll to portfolio or contact.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Portfolio grid with category filters, project loading, and a modal for viewing project details.",
  "frontend/src/components/sections/ServicesSection.tsx": "Shows a grid of service cards using TiltCard and GlassPanel with icons and descriptions.",
  "frontend/src/components/sections/SkillsSection.tsx": "Animated skill bars that reveal progress when in view, respecting reduced motion settings.",
  "frontend/src/components/visual/GlassPanel.tsx": "Reusable glassmorphism panel component with configurable neon color styles.",
  "frontend/src/components/visual/GlobalBackground.tsx": "Renders global animated starfield and layered background images with reduced‑motion support.",
  "frontend/src/components/visual/OrbitingChips.tsx": "Displays animated skill chips orbiting in a circle, disabling animation when reduced motion is preferred.",
  "frontend/src/components/visual/TiltCard.tsx": "Creates a card that tilts based on mouse position, with motion disabled for reduced-motion users.",
  "frontend/src/content/placeholderContent.ts": "Provides hardcoded placeholder projects and featured items for display before backend data exists.",
  "frontend/src/content/siteConfig.ts": "Stores site-wide config including name and social media links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, reloading dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth provider and hook handling login, stored identity, and related state.",
  "frontend/src/hooks/useInViewOnce.ts": "Offers a hook that tracks when an element first enters the viewport using IntersectionObserver.",
  "frontend/src/hooks/useQueries.ts": "Defines data-fetching hooks using react-query for projects, categories, featured items, and contact submission.",
  "frontend/src/index.css": "Configures Tailwind styles, custom animations, color variables, and global UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/utils/reducedMotion.ts": "Provides hooks to detect reduced-motion preference and adjust animation durations.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL or hash parameters, persisting them in sessionStorage, and removing them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, shadows, and plugin integrations.",
  "project_state.json": "Project state file describing the site's concept, architecture, issues, and feature requirements for a futuristic portfolio build."
}