{
  "backend/main.mo": "Defines project, message, category types with comparison and filtering utilities, plus authorization mixin and in-memory maps for projects, featured items, messages, and user profiles.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature requests to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend files describing their roles in the portfolio site's UI, hooks, content, and configuration.",
  "frontend/index.css": "Defines global Tailwind-based OKLCH theme variables for light/dark modes and applies base backgrounds, borders, and text colors.",
  "frontend/index.html": "Basic HTML entry point that loads the React app via main.tsx and defines the document head and root div.",
  "frontend/src/App.tsx": "Main React app component setting dark theme, rendering all content sections, and showing a global background and toaster.",
  "frontend/src/components/portfolio/PortfolioItemModal.tsx": "Modal displaying project details with escape-close logic, image, description, category display, and featured tag.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders the About section with a glass panel, glowing avatar, orbiting chips, and short descriptive bio about the designer.",
  "frontend/src/components/sections/ContactSection.tsx": "Implements a contact form with validation, submission via mutation, and social/WhatsApp links using a styled GlassPanel.",
  "frontend/src/components/sections/FeaturedProjectsSection.tsx": "Displays a carousel of featured projects, falling back to placeholder items when backend data is unavailable.",
  "frontend/src/components/sections/FooterSection.tsx": "Renders the site footer with dynamic year, hostname-based referral link, and styling elements.",
  "frontend/src/components/sections/HeroSection.tsx": "Creates an animated hero banner with parallax effects, floating text, and buttons that scroll to portfolio or contact sections.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Shows filterable project grid with category selection and modal display, using backend or placeholder project data.",
  "frontend/src/components/sections/ServicesSection.tsx": "Lists service cards with icons and neon-styled GlassPanel elements using TiltCard interactions.",
  "frontend/src/components/sections/SkillsSection.tsx": "Renders animated skill progress bars triggered on viewport entry and respecting reduced-motion settings.",
  "frontend/src/components/visual/GlassPanel.tsx": "Provides a reusable glassmorphism-styled container with configurable neon border colors.",
  "frontend/src/components/visual/GlobalBackground.tsx": "Renders an animated starfield canvas background with reduced-motion support and layered visual effects.",
  "frontend/src/components/visual/OrbitingChips.tsx": "Renders skill chips positioned in a circular orbit with optional floating animation based on reduced‑motion preference.",
  "frontend/src/components/visual/TiltCard.tsx": "Creates a card that tilts in 3D based on cursor movement unless reduced‑motion is enabled.",
  "frontend/src/content/placeholderContent.ts": "Provides placeholder project and featured item data with IDs, descriptions, categories, and image URLs.",
  "frontend/src/content/siteConfig.ts": "Exports basic site configuration including name, WhatsApp link, and social links.",
  "frontend/src/hooks/useActor.ts": "Builds and caches a backend actor tied to Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, identity loading, and status management.",
  "frontend/src/hooks/useInViewOnce.ts": "Custom hook that reports when an element enters the viewport once using IntersectionObserver.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching projects, categories, featured items, and submitting contact messages.",
  "frontend/src/index.css": "Tailwind setup with custom CSS variables, animations, theming, scrollbar styling, and reduced‑motion rules.",
  "frontend/src/main.tsx": "Main entry mounting the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/reducedMotion.ts": "Provides utilities for detecting reduced‑motion preference and adjusting animation durations.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters (including hash routing), storing/retrieving them in sessionStorage, and clearing them for persistence and security.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for a neon sci‑fi style UI with extended shadows, keyframes, and container settings.",
  "project_state.json": "Describes the project's current state and requirements for a futuristic 3D sci‑fi portfolio site, including visual direction, features, and architectural notes."
}