{
  "kind": "build_request",
  "title": "Fix site-wide unclickable UI (clicks not responding)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Investigate and fix the issue where the published portfolio site UI does not respond to clicks (buttons, links, portfolio items, and form inputs). Identify any global overlay elements, stacking-context/z-index issues, or CSS/pointer-events rules that are preventing pointer events from reaching interactive elements.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "it is not responsing to any click"
        ]
      },
      "acceptanceCriteria": [
        "On the published site, clicking the HERO CTA buttons triggers their intended actions (scroll to #portfolio and scroll to #contact).",
        "In PORTFOLIO, clicking a project card opens the project modal; clicking the backdrop or the close button closes it.",
        "In CONTACT, input fields can be focused and typed into; the WhatsApp Direct button and social links are clickable.",
        "No full-screen decorative layer (background gradients, starfield canvas, hero background images/grids, scanline effects, etc.) blocks pointer events over the main content."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Ensure all purely decorative, full-screen/absolute/fixed visual layers do not capture pointer events (e.g., background canvases, fixed grid overlays, hero background image layers), while keeping interactive content layers clickable and visually unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "it is not responsing to any click"
        ]
      },
      "acceptanceCriteria": [
        "Decorative layers render normally but have no impact on clicking/scrolling/hovering interactive UI.",
        "Interactive components remain above decorative layers in stacking order and reliably receive click events across sections."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Add a minimal in-app debug aid for this specific issue: when running in development mode, provide an easy way to verify click handling is working (e.g., a small temporary click test element or console logging gated to development only) and remove/disable it for production builds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "it is not responsing to any click"
        ]
      },
      "acceptanceCriteria": [
        "In development, it is straightforward to verify click handling without inspecting multiple components manually.",
        "Production build contains no visible debug UI and does not log noisy click-debug output."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Implementing a CMS/editor for the live site.",
    "Changing the visual theme or redesigning sections beyond what is required to restore click interactivity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}