{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore click interactivity by removing pointer-event blocking overlays",
  "requirements": [
    {
      "id": "REQ-17",
      "summary": "Identify and fix any global overlay/stacking-context/CSS pointer-event rules preventing clicks from reaching interactive elements site-wide.",
      "acceptanceCriteria": [
        "On the published site, clicking the HERO CTA buttons triggers their intended actions (scroll to #portfolio and scroll to #contact).",
        "In PORTFOLIO, clicking a project card opens the project modal; clicking the backdrop or the close button closes it.",
        "In CONTACT, input fields can be focused and typed into; the WhatsApp Direct button and social links are clickable.",
        "No full-screen decorative layer (background gradients, starfield canvas, hero background images/grids, scanline effects, etc.) blocks pointer events over the main content."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Audit the top-level layout stacking contexts and ensure the main content layer reliably sits above decorative layers (e.g., enforce a clear z-index strategy and avoid any accidental full-screen overlay covering <main>). Also wire in the dev-only click debug aid (REQ-19) behind a development-only gate."
        },
        {
          "path": "frontend/src/components/visual/GlobalBackground.tsx",
          "operation": "modify",
          "description": "Ensure all full-screen background layers (gradient div, starfield canvas, and grid image layer) cannot capture pointer events; verify their z-index keeps them behind content while remaining visually unchanged."
        },
        {
          "path": "frontend/src/components/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Ensure the hero's absolute/fixed decorative background layers (the image/grid parallax container) do not intercept clicks intended for CTA buttons; confirm content remains above decorative layers and buttons continue to scroll to #portfolio and #contact."
        },
        {
          "path": "frontend/src/components/sections/PortfolioSection.tsx",
          "operation": "modify",
          "description": "Verify project card click handling is not blocked by any overlaying decorative layers; ensure clicking a card still sets the selected project and opens the modal reliably."
        },
        {
          "path": "frontend/src/components/sections/ContactSection.tsx",
          "operation": "modify",
          "description": "Verify form inputs and links are not blocked by overlays; ensure inputs can be focused/typed into and external links/buttons are clickable after overlay pointer-event fixes."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Make all purely decorative full-screen/absolute/fixed visual layers ignore pointer events while keeping visuals unchanged and interactive layers on top.",
      "acceptanceCriteria": [
        "Decorative layers render normally but have no impact on clicking/scrolling/hovering interactive UI.",
        "Interactive components remain above decorative layers in stacking order and reliably receive click events across sections."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add a small set of global utility rules/classes to standardize decorative-layer behavior (e.g., a reusable class that applies pointer-events: none for purely decorative overlays) and, if needed, a safe z-index convention to keep interactive content above background layers."
        },
        {
          "path": "frontend/src/components/visual/GlobalBackground.tsx",
          "operation": "modify",
          "description": "Apply the decorative-layer no-pointer-events convention to every full-screen background layer in this component (not just the canvas) to guarantee they never capture clicks/hover/scroll."
        },
        {
          "path": "frontend/src/components/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Apply the decorative-layer no-pointer-events convention to the hero background visual container/layers (absolute inset elements and spinning images) so only the intended interactive content receives pointer events."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Add a minimal development-only click/debug aid to quickly confirm click handling works, with no visible/debug logging in production builds.",
      "acceptanceCriteria": [
        "In development, it is straightforward to verify click handling without inspecting multiple components manually.",
        "Production build contains no visible debug UI and does not log noisy click-debug output."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/debug/ClickDebug.tsx",
          "operation": "create",
          "description": "Create a minimal dev-only click verification helper (e.g., a small fixed test button/overlay that reports click success and/or logs a single concise message). Ensure it is designed to not obstruct the UI (small footprint, positioned away from primary controls) and is appropriate for temporary diagnosis."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Render the ClickDebug helper only in development mode (e.g., gated by the build tool’s dev flag) so production builds contain no visible debug UI and no click-debug logging."
        }
      ]
    }
  ]
}